let handler = async (m, { conn, usedPrefix, command, text }) => {
const tools = `⽗𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓⽗
   🪶*كــــل القــوائــم*🪶
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓   
﹝• م1 •﹞  
*الــرومــات* 🪶
﹝• م2 •﹞  
*قــســم الــديــن الاســلامــي* 📿
﹝• م3 •﹞  
*قــســم الــتــرفــيــه* 🕹     
﹝• م4 •﹞   
*قــســم التــنزيــلات* 🛡
﹝• م5 •﹞   
*قــســم التــحــويــلات* 🌀
﹝• م6 •﹞   
*قــســم الـمطـور فـقط* 👑
﹝• م7 •﹞    
*كــل الاوامــــر*
𓅓 ⋅ ───━ •﹝🪶﹞• ━─── ⋅ 𓅓
*لا تنسى النقطه لطلب القسم اكتب نقطه و م*
*لكى تعرف المطور اكتب نقطه سورس*
*الــــمطــــور بــــــلاڪ بــــيــحــــبــڪ*
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓`; 
const group = `⽗𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓⽗
الــرومــات 🪶
𓅓 ⋅ ───━ •﹝🪶﹞• ━─── ⋅ 𓅓
﹝🝓 ضيف 🝓﹞
﹝🝓 الاشباح 🝓﹞
﹝🝓 طرد 🝓﹞
﹝🝓 منشني 🝓﹞
﹝🝓 ترقيه 🝓﹞
﹝🝓 اعفاء 🝓﹞
﹝🝓 انذار 🝓﹞
﹝🝓 حذف_انذار 🝓﹞
﹝🝓 حذف 🝓﹞
﹝🝓 منشن 🝓﹞
﹝🝓 عملات 🝓﹞
﹝🝓 مخفي 🝓﹞
﹝🝓 المشرفين 🝓﹞
﹝🝓 بروفايل 🝓﹞
﹝🝓 الجروب 🝓﹞
﹝🝓 دعوه 🝓﹞
﹝🝓 تغيير_اللينك 🝓﹞
﹝🝓 لفل 🝓﹞
﹝🝓 جروب 🝓﹞
﹝🝓 جروب فتح 🝓﹞
﹝🝓 جروب قفل 🝓﹞
﹝🝓 خط 🝓﹞
﹝🝓 توب 🝓﹞
﹝🝓 لينك 🝓﹞
﹝🝓 يومي 🝓﹞
﹝🝓 الماس 🝓﹞
﹝🝓 ترتيب_البنك 🝓﹞
﹝🝓 شراء 🝓﹞
﹝🝓 هجوم 🝓﹞
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓`; 
const p2 = `⽗𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓⽗
قــســم الــديــن الاســلامــي 📿
𓅓 ⋅ ───━ •﹝🪶﹞• ━─── ⋅ 𓅓 
﹝✿ سورة ✿﹞
﹝✿ حديث ✿﹞
﹝✿ قران ✿﹞
﹝✿ الله ✿﹞
﹝✿ ايات ✿﹞
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓`;
const p3 = `⽗𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓⽗
قــســم الــتــرفــيــه 🕹
𓅓 ⋅ ───━ •﹝🪶﹞• ━─── ⋅ 𓅓
﹝🝤 اكس او 🝤﹞
﹝🝤 نصيحه 🝤﹞
﹝🝤 صراحه 🝤﹞
﹝🝤 ذكاء 🝤﹞
﹝🝤 غباء 🝤﹞
﹝🝤 جمال 🝤﹞
﹝🝤 الحب 🝤﹞
﹝🝤 لو 🝤﹞
﹝🝤 لوجو 🝤﹞
﹝🝤 هل 🝤﹞
﹝🝤 ترجم 🝤﹞
﹝🝤 تفكيك 🝤﹞
﹝🝤 ميمز 🝤﹞
﹝🝤 دمج 🝤﹞
﹝🝤 زواج 🝤﹞
﹝🝤 طلاق 🝤﹞
﹝🝤 صحاب 🝤﹞
﹝🝤 جنيه 🝤﹞
﹝🝤 بلاك 🝤﹞
﹝🝤 تاج 🝤﹞
﹝🝤 حكمه 🝤﹞
﹝🝤 عين 🝤﹞
﹝🝤 علم 🝤﹞
﹝🝤 شخصيه 🝤﹞
﹝🝤 بيحبنى 🝤﹞
﹝🝤 بايدن 🝤﹞
﹝🝤 بوست 🝤﹞
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓`;
const p4 = `⽗𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓⽗
التــنزيــلات 🛡
𓅓 ⋅ ───━ •﹝🪶﹞• ━─── ⋅ 𓅓
﹝🜝 انستغرام 🜝﹞
﹝🜝 جوجل 🜝﹞
﹝🜝 لريك 🜝﹞
﹝🜝 تطقيم 🜝﹞
﹝🜝 انستا 🜝﹞
﹝🜝 اسم_الاغنية 🜝﹞
﹝🜝 فيس 🜝﹞
﹝🜝 بين 🜝﹞
﹝🜝 ميديافاير 🜝﹞
﹝🜝 شغل 🜝﹞
﹝🜝 تيكتوك 🜝﹞
﹝🜝 تويتر 🜝﹞
﹝🜝 بحث 🜝﹞
﹝🜝 فيديو 🜝﹞
﹝🜝 تطبيق 🜝﹞
﹝🜝 صوره 🜝﹞
﹝🜝 2صوره 🜝﹞
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓`;  
const p5 = `⽗𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓⽗
التــحــويــلات 🌀
𓅓 ⋅ ───━ •﹝🪶﹞• ━─── ⋅ 𓅓
﹝✹ استك ✹﹞
﹝✹ سرقة ✹﹞
﹝✹ لفيديو ✹﹞
﹝✹ لصورة ✹﹞
﹝✹ دائري ✹﹞
﹝✹ لرابط ✹﹞
﹝✹ لانمي ✹﹞
﹝✹ تخيل ✹﹞
﹝✹ مكس ✹﹞
﹝✹ لجواهر ✹﹞
﹝✹ ستك ✹﹞
﹝✹ تلجراف ✹﹞
﹝✹ لكرتون ✹﹞
﹝✹ باركود ✹﹞
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓`;
const p6 = `⽗𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓⽗
الــــمــــطـــــور فـــــقــــط 👑
𓅓 ⋅ ───━ •﹝🪶﹞• ━─── ⋅ 𓅓
﹝🜟 ضيف_بريميام 🜟﹞   
﹝🜟 حذف_بريميام 🜟﹞
﹝🜟 الحاله 🜟﹞
﹝🜟 ارفعنى 🜟﹞
﹝🜟 حط_اونر 🜟﹞
﹝🜟 ريستارت 🜟﹞
﹝🜟 بان 🜟﹞
﹝🜟 الغاء_البان 🜟﹞  
﹝🜟 المبندين 🜟﹞  
﹝🜟 إعادة 🜟﹞
﹝🜟 اعادة_تشغيل 🜟﹞ 
﹝🜟 أدخل 🜟﹞
﹝🜟 ضيف_اكس_بي 🜟﹞ 
﹝🜟 ضيف_جواهر 🜟﹞
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓`; 
const p7 = `  ⊑ ━═ ⋖ 💎 ⋗ ═━ ⊒ 
 *قـسـم الــفــعـالـيـات الـعـاب*🤽

  ⊑ ━═ ⋖ 🤽  ⋗ ═━ ⊒ 

⋖ 💎دين💎 ⋗
       ⊑ ━═══━ ⊒ 
⋖ 💎عين💎 ⋗
       ⊑ ━═══━ ⊒ 
⋖ 💎ثقافه💎 ⋗
       ⊑ ━═══━ ⊒ 
⋖ 💎ثقافة💎 ⋗
       ⊑ ━═══━ ⊒ 
⋖ 💎علم💎 ⋗
       ⊑ ━═══━ ⊒ 
⋖ 💎كوره💎 ⋗
       ⊑ ━═══━ ⊒ 
⋖ 💎اوتاكو💎 ⋗
       ⊑ ━═══━ ⊒ 
⋖ 💎ماتشينج💎 ⋗
       ⊑ ━═══━ ⊒ 
⋖ 💎لوجو💎 ⋗
       ⊑ ━═══━ ⊒ 
⋖ 💎جمع💎 ⋗
       ⊑ ━═══━ ⊒ 
⋖ 💎تفكيك💎 ⋗

  ⊑ ━═ ⋖ 👑 ⋗ ═━ ⊒`;
const messages = [[ 
tools, 
'𝐵𝐿𝐴𝐶𝐾 𝐵𝛩𝑇',
'https://telegra.ph/file/5aa0f0e81ff5d345cfdc6.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029VacWb364dTnEKmVWd628']]
], [
group, 
'𝐵𝐿𝐴𝐶𝐾 𝐵𝛩𝑇',
'https://telegra.ph/file/5aa0f0e81ff5d345cfdc6.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029VacWb364dTnEKmVWd628']]
], [
p2, 
'𝐵𝐿𝐴𝐶𝐾 𝐵𝛩𝑇',
'https://telegra.ph/file/5aa0f0e81ff5d345cfdc6.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029VacWb364dTnEKmVWd628']]
], [
p3, 
'𝐵𝐿𝐴𝐶𝐾 𝐵𝛩𝑇',
'https://telegra.ph/file/5aa0f0e81ff5d345cfdc6.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029VacWb364dTnEKmVWd628']]
], [
p4, 
'𝐵𝐿𝐴𝐶𝐾 𝐵𝛩𝑇',
'https://telegra.ph/file/5aa0f0e81ff5d345cfdc6.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029VacWb364dTnEKmVWd628']]
], [
p5, 
'𝐵𝐿𝐴𝐶𝐾 𝐵𝛩𝑇',
'https://telegra.ph/file/5aa0f0e81ff5d345cfdc6.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029VacWb364dTnEKmVWd628']]
], [   
p6, 
'𝐵𝐿𝐴𝐶𝐾 𝐵𝛩𝑇',
'https://telegra.ph/file/5aa0f0e81ff5d345cfdc6.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029VacWb364dTnEKmVWd628']]
], [
p7, 
'𝐵𝐿𝐴𝐶𝐾 𝐵𝛩𝑇',
'https://telegra.ph/file/5aa0f0e81ff5d345cfdc6.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029VacWb364dTnEKmVWd628']]
]]   
await conn.sendCarousel(m.chat,`مرحبا ${m.pushName}`, 'هذه هيا قوائم البوت', `قــســم`, messages, m)            

}
handler.command = /^(ترو)$/i
export default handler
